basic-theory.md


# The very basics


## Notes

Sounds are vibrations in air that we can hear. Slower vibrations give lower sounds, faster
vibrations give higher sounds and good vibrations give goosebumps. Let's call these vibrations 
the **pitch**. Pitch is measured in hertz or vibrations per second.


### TODO Illustration of vibrating string or speaker

Talking about pitch isn't very intuitive so we took certain pitches and gave them names. For
example 440 hertz is generally used for a **note** called "A". 

Notes have different relationships with each other. Some are friendly and sound **harmonious**, 
some might clash with each other and sound **discordant**. We will talk a lot about the 
distance between notes so let's call this the **interval** between two
notes. It turns out that identifying the actual notes, whilst helpful, is not as powerful as 
understanding how notes relate to each other.


### TODO Illustrate two notes on an instrument and the same two notes on a score


## Our first two important intervals

Our ears can clearly tell when one note is vibrating twice as fast as a lower note. For reasons 
that will become clear shortly, we call this distance or interval between notes an **octave**.
Octaves are quite far apart, so we need to chop them up into smaller intervals. It turns out our 
ears are very sensitive to how we do this. The majority of music today is made by chopping up 
the distance between two octaves into 12 parts called **semitones** (or half-steps).
A distance of two semitones is called a **tone** or whole tone (or whole-step).

You can see on a guitar neck, the 12th fret will give a note one octave higher than the open 
string. Each fret is a semitone. You can also see a repeating pattern of white and black keys 
on a piano which are the 12 semitones between the octaves. Each key is a semitone apart.


### TODO Guitar neck and piano keyboard illustration


## Summary so far

Now we have **notes** and **interval** between any two notes. We have **octaves** divided into
**semitones** and **tones**. We know that these were not arbitrary choices but are a language devised
to describe this phenomena of how notes interact to make **music**


# Scales


## Using intervals to define scales

We found there are groupings of notes that have interesting relationships with each other. We 
can define these groups by their intervals and we call these groups **scales**. An important scale 
is the **Major scale**, which has 7 notes and can be played as follows:

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">tone</td>
<td class="org-left">tone</td>
<td class="org-left">semitone</td>
<td class="org-left">tone</td>
<td class="org-left">tone</td>
<td class="org-left">tone</td>
<td class="org-left">semitone</td>
</tr>
</tbody>
</table>

We can write this shorter as **TTSTTTS**.

You should try playing it at this point. Pick any note on a guitar or key on a piano and 
then simply count them out (pick a note and stay on the same string for guitar or ensure you count
all notes black and white on a keyboard):

-   Play a random first note
-   go up 1 tone (or 2 semitones, 2 frets, 2 keys) to the 2nd note,
-   1 tone (or 2 semitones) again to the 3rd note,
-   1 semitone to the 4th note,
-   1 tone to the 5th note,
-   1 tone to the 6th note,
-   1 tone to the 7th note,
-   1 semitone takes us to the next octave (or 8th or 8ve).


### TODO Illustration of playing this on a guitar neck and keyboard

Hopefully you now see why octaves have their name, based on the major scale, it takes 8 
intervals to get from one octave to the next. Did it sound right to your ears? You should have 
played a major scale but we haven't yet named any notes!

You will understand a lot more about music if you think in intervals, with the degrees of the 
scale as 1st, 2nd, 3rd, 4th, 5th, 6th, 7th, 8th (and keep going &#x2026; 9th, 11th, 13th, etc). We 
will use this a lot.


## Keys and scales

First let's name the 12 semitones. Some have letters and some are considered sharp (&sharp;) or 
flat (&flat;). Using sharps, we can write the 12 semitones out like this:

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-right">3</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-right">5</th>
<th scope="col" class="org-right">6</th>
<th scope="col" class="org-right">7</th>
<th scope="col" class="org-right">8</th>
<th scope="col" class="org-right">9</th>
<th scope="col" class="org-right">10</th>
<th scope="col" class="org-right">11</th>
<th scope="col" class="org-right">12</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">C</td>
<td class="org-right">C&sharp; / D&flat;</td>
<td class="org-right">D</td>
<td class="org-right">D&sharp; / E&flat;</td>
<td class="org-right">E</td>
<td class="org-right">F</td>
<td class="org-right">F&sharp; / G&flat;</td>
<td class="org-right">G</td>
<td class="org-right">G&sharp; / A&flat;</td>
<td class="org-right">A</td>
<td class="org-right">A&sharp; / B&flat;</td>
<td class="org-right">B</td>
</tr>
</tbody>
</table>

There is no extra note between E and F, nor between B and C. Unfortunately these extra notes may have 
two (or more!!) names because the &flat; or &sharp; is not really a name but an instruction to the
musician to sharpen or flatten by a semitone. So &sharp;&sharp; means to sharpen by a whole tone. In 
between C and D is a note that is either C&sharp; [see-Sharp] or D&flat; [dee-flat]. This is 
actually to simplify things. We'll begin to see how, as we progress.

Let us now try naming some notes in the major scale and see what happens. Check these scales using 
the table of named semitones above and the TTSTTTS pattern.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Degree</th>
<th scope="col" class="org-left">C Major</th>
<th scope="col" class="org-left">G Major</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
</tr>


<tr>
<td class="org-left">2nd</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
</tr>


<tr>
<td class="org-left">3rd</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-left">4th</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-left">5th</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
</tr>


<tr>
<td class="org-left">6th</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
</tr>


<tr>
<td class="org-left">7th</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
</tr>


<tr>
<td class="org-left">8th</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
</tr>
</tbody>
</table>

To make things simpler, we want to have an A B C D E F and G in every major scale. This is why, in the 
G Major example above, we choose to use the F&sharp; and not G&flat;. It is much clearer to 
have A B C D E F&sharp; G than with two G's in A B C D E G&flat; G.

Now we can talk about music being in a **key**, for example the music may centre around G and
use mostly notes from the major scale, so it's key is G Major. When we say key of G Major we 
are saying the **root** or **tonic** or **tonal centre** is G and we determine the rest of the notes 
using the interval pattern TTSTTTS.
