basic-theory.org
** All major scales
Using everything we've learned so far, we can now construct every major scale. There will be one 
for each of our 12 notes. You should try doing this yourself. Start with the easy one, C, but don't 
make the next one D, rather choose the 5th interval of C for the next key (which is G). We'll see why
we did this in a moment. Here's a starter for you:
#+ATTR_HTML: :border 0 :rules all :frame none
  | Degree | C | G       | D |   |   |   |   |   |   |
  |--------+---+---------+---+---+---+---+---+---+---|
  | 1st    | C | G       |   |   |   |   |   |   |   |
  | 2nd    | D | A       |   |   |   |   |   |   |   |
  | 3rd    | E | B       |   |   |   |   |   |   |   |
  | 4th    | F | C       |   |   |   |   |   |   |   |
  | *5th*  | G | D       |   |   |   |   |   |   |   |
  | 6th    | A | E       |   |   |   |   |   |   |   |
  | 7th    | B | F\sharp |   |   |   |   |   |   |   |

When we get to F\sharp things start getting a bit tricky. We end up with needing an E\sharp. Remember 
the \sharp is an instruction to sharpen the E by one semintone, which correctly gives F, so E\sharp
is perfectly valid. Carrying on the C\sharp scale now has E\sharp and B\sharp. Once we get to 
G\sharp we're really in trouble, it has become impossible to support our desire to have ABCDEFG in 
each scale unless we write F\sharp{}\sharp{}. 
#+ATTR_HTML: :border 0 :rules all :frame none
  | Degree | C | G       | D       | A       | E       | B       | F\sharp     | C\sharp / D\flat | G\sharp / A\flat    |
  |--------+---+---------+---------+---------+---------+---------+-------------+------------------+---------------------|
  | 1st    | C | G       | D       | A       | E       | B       | F\sharp     | C\sharp          | G\sharp             |
  | 2nd    | D | A       | E       | B       | F\sharp | C\sharp | G\sharp     | D\sharp          | A\sharp             |
  | 3rd    | E | B       | F\sharp | C\sharp | G\sharp | D\sharp | A\sharp     | E\sharp (F)      | B\sharp (C)         |
  | 4th    | F | C       | G       | D       | A       | E       | B           | F\sharp          | C\sharp             |
  | *5th*  | G | D       | A       | E       | B       | F\sharp | C\sharp     | G\sharp          | D\sharp             |
  | 6th    | A | E       | B       | F\sharp | C\sharp | G\sharp | D\sharp     | A\sharp          | E\sharp(F)          |
  | 7th    | B | F       | C\sharp | G\sharp | D\sharp | A\sharp | E\sharp (F) | B\sharp (C)      | *F\sharp{}\sharp{}* |
  | 8th    | C | F\sharp | D       | A       | E       | B       | F\sharp     | C\sharp          | G\sharp             |

Whilst it is actually valid to write F\sharp{}\sharp{}, by using flats, we can make things much clearer.
#+ATTR_HTML: :border 0 :rules all :frame none
  | Degree | C\sharp / D\flat | G\sharp / A\flat | D\sharp / E\flat | A\sharp / B\flat | F      | C | G       | D       | A       | E       | B       | F\sharp / G\flat |
  |--------+------------------+------------------+------------------+------------------+--------+---+---------+---------+---------+---------+---------+------------------|
  | 1st    | D\flat           | A\flat           | E\flat           | B\flat           | F      | C | G       | D       | A       | E       | B       | F\sharp          |
  | 2nd    | E\flat           | B\flat           | F                | C                | G      | D | A       | E       | B       | F\sharp | C\sharp | G\sharp          |
  | 3rd    | F                | C                | G                | D                | A      | E | B       | F\sharp | C\sharp | G\sharp | D\sharp | A\sharp          |
  | <- 4th | G\flat           | D\flat           | A\flat           | E\flat           | B\flat | F | C       | G       | D       | A       | E       | B                |
  | 5th -> | A\flat           | E\flat           | B\flat           | F                | C      | G | D       | A       | E       | B       | F\sharp | C\sharp          |
  | 6th    | B\flat           | F                | C                | G                | D      | A | E       | B       | F\sharp | C\sharp | G\sharp | D\sharp          |
  | 7th    | C                | G                | D                | A                | E      | B | F       | C\sharp | G\sharp | D\sharp | A\sharp | E\sharp[F]       |
  | 8th    | D\flat           | A\flat           | E\flat           | B\flat           | F      | C | F\sharp | D       | A       | E       | B       | F\sharp          |
You should be able to see that the 5th of F\sharp is C\sharp or D\flat and so loops back to 
the 1st column. This circular reference forms part of the circle of 5ths which was invented by 
Pythagoras. From left to right you choose the 5th to get the next scale and right to left you 
choose the 4th. 

Let's reformat that table so you can you see how the flats and sharps build up as well as other 
patterns between the keys. Columns are orderd in 5ths and rows are ordered in 5ths.
#+ATTR_HTML: :border 0 :rules all :frame none
  | D\flat | A\flat | E\flat | B\flat | F      | C | G       | D       | A       | E       | B       | F\sharp    |
  |--------+--------+--------+--------+--------+---+---------+---------+---------+---------+---------+------------|
  | F      | F      | F      | F      | F      | F | F\sharp | F\sharp | F\sharp | F\sharp | F\sharp | F\sharp    |
  | C      | C      | C      | C      | C      | C | C       | C\sharp | C\sharp | C\sharp | C\sharp | C\sharp    |
  | G\flat | G      | G      | G      | G      | G | G       | G       | G\sharp | G\sharp | G\sharp | G\sharp    |
  | D\flat | D\flat | D      | D      | D      | D | D       | D       | D       | D\sharp | D\sharp | D\sharp    |
  | A\flat | A\flat | A\flat | A      | A      | A | A       | A       | A       | A       | A\sharp | A\sharp    |
  | E\flat | E\flat | E\flat | E\flat | E      | E | E       | E       | E       | E       | E       | E\sharp[F] |
  | B\flat | B\flat | B\flat | B\flat | B\flat | B | B       | B       | B       | B       | B       | B          |

