basic-theory.md


## All major scales

Using everything we've learned so far, we can now construct every major scale. There will be one 
for each of our 12 notes. You should try doing this yourself. Start with the easy one, C, but don't 
make the next one D, rather choose the 5th interval of C for the next key (which is G). We'll see why
we did this in a moment. Here's a starter for you:

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Degree</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">2nd</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">3rd</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">4th</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">**5th**</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">6th</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">7th</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

When we get to F&sharp; things start getting a bit tricky. We end up with needing an E&sharp;. Remember 
the &sharp; is an instruction to sharpen the E by one semintone, which correctly gives F, so E&sharp;
is perfectly valid. Carrying on the C&sharp; scale now has E&sharp; and B&sharp;. Once we get to 
G&sharp; we're really in trouble, it has become impossible to support our desire to have ABCDEFG in 
each scale unless we write F&sharp;&sharp;. 

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Degree</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">F&sharp;</th>
<th scope="col" class="org-left">C&sharp; / D&flat;</th>
<th scope="col" class="org-left">G&sharp; / A&flat;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
</tr>


<tr>
<td class="org-left">2nd</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
</tr>


<tr>
<td class="org-left">3rd</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
<td class="org-left">E&sharp; (F)</td>
<td class="org-left">B&sharp; (C)</td>
</tr>


<tr>
<td class="org-left">4th</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
</tr>


<tr>
<td class="org-left">**5th**</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
</tr>


<tr>
<td class="org-left">6th</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
<td class="org-left">E&sharp;(F)</td>
</tr>


<tr>
<td class="org-left">7th</td>
<td class="org-left">B</td>
<td class="org-left">F</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
<td class="org-left">E&sharp; (F)</td>
<td class="org-left">B&sharp; (C)</td>
<td class="org-left">**F&sharp;&sharp;**</td>
</tr>


<tr>
<td class="org-left">8th</td>
<td class="org-left">C</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
</tr>
</tbody>
</table>

Whilst it is actually valid to write F&sharp;&sharp;, by using flats, we can make things much clearer.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Degree</th>
<th scope="col" class="org-left">C&sharp; / D&flat;</th>
<th scope="col" class="org-left">G&sharp; / A&flat;</th>
<th scope="col" class="org-left">D&sharp; / E&flat;</th>
<th scope="col" class="org-left">A&sharp; / B&flat;</th>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">F&sharp; / G&flat;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">1st</td>
<td class="org-left">D&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
</tr>


<tr>
<td class="org-left">2nd</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
</tr>


<tr>
<td class="org-left">3rd</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
</tr>


<tr>
<td class="org-left"><- 4th</td>
<td class="org-left">Gb</td>
<td class="org-left">D&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-left">5th -></td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
</tr>


<tr>
<td class="org-left">6th</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
</tr>


<tr>
<td class="org-left">7th</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
<td class="org-left">E&sharp;[F]</td>
</tr>


<tr>
<td class="org-left">8th</td>
<td class="org-left">D&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
</tr>
</tbody>
</table>

You should be able to see that the 5th of F&sharp; is C&sharp; or D&flat; and so loops back to 
the 1st column. This circular reference forms part of the circle of 5ths which was invented by 
Pythagoras. From left to right you choose the 5th to get the next scale and right to left you 
choose the 4th. 

Let's reformat that table so you can you see how the flats and sharps build up as well as other 
patterns between the keys. Columns are orderd in 5ths and rows are ordered in 5ths.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">D&flat;</th>
<th scope="col" class="org-left">A&flat;</th>
<th scope="col" class="org-left">E&flat;</th>
<th scope="col" class="org-left">B&flat;</th>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">F&sharp;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
</tr>


<tr>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">C&sharp;</td>
</tr>


<tr>
<td class="org-left">Gb</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">G&sharp;</td>
</tr>


<tr>
<td class="org-left">D&flat;</td>
<td class="org-left">D&flat;</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">D&sharp;</td>
</tr>


<tr>
<td class="org-left">A&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">A&sharp;</td>
<td class="org-left">A&sharp;</td>
</tr>


<tr>
<td class="org-left">E&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">E&sharp;[F]</td>
</tr>


<tr>
<td class="org-left">B&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
</tr>
</tbody>
</table>
