basic-theory.org
** Minor scales
Because you know all the major scales, and you understand intervals, you know the *minor scales* as 
well. All you need are the rules on how to find them. One way to find a minor scale is to go left 
by 3 intervals from the root of the major scale. Start there and play all the notes from the major 
scale, you have found the *natural minor* or *relative minor*. 
#+ATTR_HTML: :border 0 :rules all :frame none
  | Major | D\flat    | A\flat | E\flat | B\flat | F  | C  | G  | D  | A          | E          | B          | F\sharp    |
  | Minor | B\flat{}m | Fm     | Cm     | Gm     | Dm | Am | Em | Bm | F\sharp{}m | C\sharp{}m | G\sharp{}m | D\sharp{}m |
Another way is looking at the pattern we use to construct a scale. Take the major TTSTTTS and 
shift it 3 to the right you get TSTTSTT. This is the same as going three intervals to the left. Yet 
another way to look at this is that the relative minor always starts on the 6th degree of the  major 
scale and uses all the same notes as the major scale.

* Chords
** Chord Basics
When we play a bunch of notes together, we're playing a *chord*. Play any notes from a given key 
and we're playing chords from that key. Chords have a strong relationship with the key of the 
music.

If you play 3 notes together, you're playing a type of chord called a *triad*,. These chords get a 
special name because they are very special chords. If you play the 1st, 3rd and 5th degrees
together you are playing a *major chord* or *major triad*. So now you instantly know all the major 
triads.
#+ATTR_HTML: :border 0 :rules all :frame none
  | Degree   | C\sharp / D\flat | G\sharp / A\flat | D\sharp / E\flat | A\sharp / B\flat | F | C | G | D       | A       | E       | B       | F\sharp / G\flat |
  |----------+------------------+------------------+------------------+------------------+---+---+---+---------+---------+---------+---------+---------|
  | root     | D\flat           | A\flat           | E\flat           | B\flat           | F | C | G | D       | A       | E       | B       | F\sharp |
  | skip one |                  |                  |                  |                  |   |   |   |         |         |         |         |         |
  | 3rd      | F                | C                | G                | D                | A | E | B | F\sharp | C\sharp | G\sharp | D\sharp | A\sharp |
  | skip one |                  |                  |                  |                  |   |   |   |         |         |         |         |         |
  | 5th      | A\flat           | E\flat           | B\flat           | F                | C | G | D | A       | E       | B       | F\sharp | C\sharp |

** Important traids
Notice the pattern is play one, skip one, play one, skip one, play one. For example in C Major
the notes are CDEFGAB and the C Major Triad is CEG skipping D and F. You can move this pattern 
around and get a bunch of other triads. Using this same pattern, we can start on each degree of a
scale. We like to give them numbers too and use upper and lower case, the case is important too.
#+ATTR_HTML: :border 0 :rules all :frame none
  | Chord     | I     | ii    | iii   | IV    | V     | vi     | vii    |
  |-----------+-------+-------+-------+-------+-------+--------+--------|
  | Intervals | 1,3,5 | 2,4,6 | 3,5,7 | 4,6,1 | 5,7,2 | 6,1,3  | 7,2,4  |
  | or        | 1,3,5 | 2,4,6 | 3,5,7 | 4,6,8 | 5,7,9 | 6,8,10 | 7,9,11 |
Let's look at these in a different way. What is the interval from 1st to 3rd? Using TTSTTTS we 
can see it's two tones and from 3rd to 5th is a semitone plus a tone. Sometimes this might be 
explained as 4 semitones then 3 semitones. This 4+3 is the pattern for a major chord.
#+ATTR_HTML: :border 0 :rules all :frame none
  | Chord        | I     | ii    | iii   | IV    | V     | vi    | vii   |
  |--------------+-------+-------+-------+-------+-------+-------+-------|
  | Intervals    | 1,3,5 | 2,4,6 | 3,5,7 | 4,6,1 | 5,7,2 | 6,1,3 | 7,2,4 |
  | In semitones | 4 + 3 | 3 + 4 | 3 + 4 | 4 + 3 | 4 + 3 | 3 + 4 | 3 + 3 |
We can see all the uppercase ones are 4+3, major chords. All except one of the lowercase ones are 
3+4, which is the pattern for a *minor chord*. The odd one out is vii. It is 3+3 and called a 
*diminished chord*. Yeah it's the runt of the family and we'll ignore it for now. 
I find it quite lovely that we have the 4+3 and 3+4 for major and minor chords. It blows my mind 
that people figured this stuff out and came up with such an elegant language of music.

