basic-theory.md


## Minor scales

Because you know all the major scales, and you understand intervals, you know the **minor scales** as 
well. All you need are the rules on how to find them. One way to find a minor scale is to go left 
by 3 intervals from the root of the major scale. Start there and play all the notes from the major 
scale, you have found the **natural minor** or **relative minor**. 

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Major</td>
<td class="org-left">D&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
</tr>


<tr>
<td class="org-left">Minor</td>
<td class="org-left">B\flatm</td>
<td class="org-left">Fm</td>
<td class="org-left">Cm</td>
<td class="org-left">Gm</td>
<td class="org-left">Dm</td>
<td class="org-left">Am</td>
<td class="org-left">Em</td>
<td class="org-left">Bm</td>
<td class="org-left">F\sharpm</td>
<td class="org-left">C\sharpm</td>
<td class="org-left">G\sharpm</td>
<td class="org-left">D\sharpm</td>
</tr>
</tbody>
</table>

Another way is looking at the pattern we use to construct a scale. Take the major TTSTTTS and 
shift it 3 to the right you get TSTTSTT. This is the same as going three intervals to the left. Yet 
another way to look at this is that the relative minor always starts on the 6th degree of the  major 
scale and uses all the same notes as the major scale.


# Chords


## Chord Basics

When we play a bunch of notes together, we're playing a **chord**. Play any notes from a given key 
and we're playing chords from that key. Chords have a strong relationship with the key of the 
music.

If you play 3 notes together, you're playing type of chord called a **triad**,. These chords get a 
special name because they are very special chords. If you play the intervals 1st, 3rd and 5th 
together you are playing a **major chord** or major triad. So now you instantly know all the major 
triads.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">C&sharp;</th>
<th scope="col" class="org-left">G&sharp;</th>
<th scope="col" class="org-left">D&sharp;</th>
<th scope="col" class="org-left">A&sharp;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Gb</th>
</tr>


<tr>
<th scope="col" class="org-left">Degree</th>
<th scope="col" class="org-left">D&flat;</th>
<th scope="col" class="org-left">A&flat;</th>
<th scope="col" class="org-left">E&flat;</th>
<th scope="col" class="org-left">B&flat;</th>
<th scope="col" class="org-left">F</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">G</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">E</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">F&sharp;</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">root</td>
<td class="org-left">D&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
</tr>


<tr>
<td class="org-left">skip one</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">3rd</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">G&sharp;</td>
<td class="org-left">D&sharp;</td>
<td class="org-left">A&sharp;</td>
</tr>


<tr>
<td class="org-left">skip one</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">5th</td>
<td class="org-left">A&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">F</td>
<td class="org-left">C</td>
<td class="org-left">G</td>
<td class="org-left">D</td>
<td class="org-left">A</td>
<td class="org-left">E</td>
<td class="org-left">B</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">C&sharp;</td>
</tr>
</tbody>
</table>


## Important traids

Notice the pattern is play one, skip one, play one, skip one, play one. For example in C Major
the notes are CDEFGAB and the C Major Triad is CEG skipping D and F. You can move this pattern 
around and get a bunch of other triads. Using this same pattern, we can start on each degree of a
scale. We like to give them numbers too and use upper and lower case, the case is important too.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Chord</th>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">ii</th>
<th scope="col" class="org-left">iii</th>
<th scope="col" class="org-left">IV</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">vi</th>
<th scope="col" class="org-left">vii</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Intervals</td>
<td class="org-left">1,3,5</td>
<td class="org-left">2,4,6</td>
<td class="org-left">3,5,7</td>
<td class="org-left">4,6,1</td>
<td class="org-left">5,7,2</td>
<td class="org-left">6,1,3</td>
<td class="org-left">7,2,4</td>
</tr>


<tr>
<td class="org-left">or</td>
<td class="org-left">1,3,5</td>
<td class="org-left">2,4,6</td>
<td class="org-left">3,5,7</td>
<td class="org-left">4,6,8</td>
<td class="org-left">5,7,9</td>
<td class="org-left">6,8,10</td>
<td class="org-left">7,9,11</td>
</tr>
</tbody>
</table>

Let's look at these in a different way. What is the interval from 1st to 3rd? Using TTSTTTS we 
can see it's two tones and from 3rd to 5th is a semitone plus a tone. Sometimes this might be 
explained as 4 semitones then 3 semitones. This 4+3 is the pattern for a major chord.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Chord</th>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">ii</th>
<th scope="col" class="org-left">iii</th>
<th scope="col" class="org-left">IV</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">vi</th>
<th scope="col" class="org-left">vii</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Intervals</td>
<td class="org-left">1,3,5</td>
<td class="org-left">2,4,6</td>
<td class="org-left">3,5,7</td>
<td class="org-left">4,6,1</td>
<td class="org-left">5,7,2</td>
<td class="org-left">6,1,3</td>
<td class="org-left">7,2,4</td>
</tr>


<tr>
<td class="org-left">In semitones</td>
<td class="org-left">4 + 3</td>
<td class="org-left">3 + 4</td>
<td class="org-left">3 + 4</td>
<td class="org-left">4 + 3</td>
<td class="org-left">4 + 3</td>
<td class="org-left">3 + 4</td>
<td class="org-left">3 + 3</td>
</tr>
</tbody>
</table>

We can see all the uppercase ones are 4+3, major chords. All except one of the lowercase ones are 
3+4, which is the pattern for a **minor chord**. The odd one out is vii. It is 3+3 and called a 
**diminished chord**. Yeah it's the runt of the family and we'll ignore it for now. 
I find it quite lovely that we have the 4+3 and 3+4 for major and minor chords. It blows my mind 
that people figured this stuff out and came up with such an elegant language of music.
