basic-theory.org
** Traids in every key
Major chords are generally just be denoted by the root note, so C Major will be written C. Minor 
chords will have the root note plus a small m, so A Minor is written Am. Flats and sharps are put 
in their proper place after the note name. Here again we can see why we want to keep the notes 
in each key labeled as ABCDEFG and use \flat and \sharp to do so. Things would get very confusing 
indeed.
#+ATTR_HTML: :border 0 :rules all :frame none
  | Key     | I       | ii         | iii        | IV     | V       | vi         |
  |---------+---------+------------+------------+--------+---------+------------|
  | D\flat  | D\flat  | E\flat{}m  | Fm         | G\flat | A\flat  | B\flat{}m  |
  | A\flat  | A\flat  | B\flat{}m  | C          | D\flat | E\flat  | Fm         |
  | E\flat  | E\flat  | Fm         | Gm         | A\flat | B\flat  | Cm         |
  | B\flat  | B\flat  | Cm         | Dm         | E\flat | F       | Gm         |
  | F       | F       | Gm         | Am         | B\flat | C       | Dm         |
  | C       | C       | Dm         | Em         | F      | G       | Am         |
  | G       | G       | Am         | Bm         | C      | D       | Em         |
  | D       | D       | Em         | F\sharp{}m | G      | A       | Bm         |
  | A       | A       | Bm         | C\sharp{}m | D      | E       | F\sharp{}m |
  | E       | E       | F\sharp{}m | G\sharp{}m | A      | B       | C\sharp{}m |
  | B       | B       | C\sharp{}m | D\sharp{}m | E      | F\sharp | G\sharp{}m |
  | F\sharp | F\sharp | G\sharp{}m | A\sharp{}m | B      | C\sharp | D\sharp{}m |

* Pieces of music and songs
** Chord progressions
*** TODO progression usage
*** TODO commonly used progressions

** Chord Inversions
*** TODO inversion usage

** Melodies
*** TODO melodies

* Appendix
** Various scales
** TODO document various scales
- Chromatic:
  If you play the 12 semitones, say by going up a guitar string, fret by fret, or by playing each 
  note (white and black) on a piano.
#+ATTR_HTML: :border 0 :rules all :frame none
  | pattern   | S | S | S | S | S | S | S | S | S | S | S | S |
  | semitones | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 | 1 |
- Major:
#+ATTR_HTML: :border 0 :rules all :frame none
  | pattern   | T | T | S | T | T | T | S |
  | semitones | 2 | 2 | 1 | 2 | 2 | 2 | 1 |
  | Interval  | 1 | 2 | 3 | 4 | 5 | 6 | 7 |
- Minor scale:
#+ATTR_HTML: :border 0 :rules all :frame none
  | pattern   | T | S | T  | T | S | T  | T  |
  | semitones | 2 | 1 | 2  | 2 | 1 | 2  | 2  |
  | Interval  | 1 | 2 | b3 | 4 | 5 | b6 | b7 |
- Pentatonic scales:
  Some poeople provide a pattern for pentatonic scales but I prefer to think about them
  as selecting 5 notes (penta) from the Major or Minor scale.
-- from the Major scale include 1, 2, 3, 5, 6 or skip the 4th and 7th
#+ATTR_HTML: :border 0 :rules all :frame none
  | semitones | 2 | 2 | 1 | 2 | 2 | 2 | 1 |
  | Interval  | 1 | 2 | 3 | 4 | 5 | 6 | 7 |
  | Include?  | 1 | 2 | 3 | X | 5 | 6 | X |
-- from the Minor scale include 1, b3, 4, 5, b7 or exclude the 2nd and flat 6th
#+ATTR_HTML: :border 0 :rules all :frame none
  | semitones | 2 | 1 | 2  | 2 | 1 | 2  | 2  |
  | Interval  | 1 | 2 | b3 | 4 | 5 | b6 | b7 |
  | Include?  | 1 | X | b3 | 4 | 5 | X  | b7 |


* Useful links
- Piano Exercises: https://pianoexercises.org recommended to me was https://pianoexercises.org/exercises/czerny/
- Various musical transcriptions: https://imslp.org
- Chordmaps, music theory and chordmaps midi app: https://www.mugglinworks.com/
- An instrument supplier who will ship to HK cheaper than buying locally https://www.thomann.de
- https://www.musictheory.net
- I think Andrew Huang's music theory in 1/2 hr is one of the 
  easiest run-through's of music theory https://www.youtube.com/watch?v=rgaTLrZGlk0
  Note, you should do the exercises and it's not half an hour, it's weeks of work if
  you take learning music theory seriously. Tip: Play it at 1.5x
- Some really insightful analysis of chord progressions and melodic overlays from the 80's
  https://www.youtube.com/watch?v=jav5xMqBWeY
- Piano scales and their fingerings: https://www.pianoscales.org

