basic-theory.md


## Traids in every key

Major chords are generally just be denoted by the root note, so C Major will be written C. Minor 
chords will have the root note plus a small m, so A Minor is written Am. Flats and sharps are put 
in their proper place after the note name. Here again we can see why we want to keep the notes 
in each key labeled as ABCDEFG and use &flat; and &sharp; to do so. Things would get very confusing 
indeed.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">I</th>
<th scope="col" class="org-left">ii</th>
<th scope="col" class="org-left">iii</th>
<th scope="col" class="org-left">IV</th>
<th scope="col" class="org-left">V</th>
<th scope="col" class="org-left">vi</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">D&flat;</td>
<td class="org-left">D&flat;</td>
<td class="org-left">E\flatm</td>
<td class="org-left">Fm</td>
<td class="org-left">Gb</td>
<td class="org-left">A&flat;</td>
<td class="org-left">B\flatm</td>
</tr>


<tr>
<td class="org-left">A&flat;</td>
<td class="org-left">A&flat;</td>
<td class="org-left">B\flatm</td>
<td class="org-left">C</td>
<td class="org-left">D&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">Fm</td>
</tr>


<tr>
<td class="org-left">E&flat;</td>
<td class="org-left">E&flat;</td>
<td class="org-left">Fm</td>
<td class="org-left">Gm</td>
<td class="org-left">A&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">Cm</td>
</tr>


<tr>
<td class="org-left">B&flat;</td>
<td class="org-left">B&flat;</td>
<td class="org-left">Cm</td>
<td class="org-left">Dm</td>
<td class="org-left">E&flat;</td>
<td class="org-left">F</td>
<td class="org-left">Gm</td>
</tr>


<tr>
<td class="org-left">F</td>
<td class="org-left">F</td>
<td class="org-left">Gm</td>
<td class="org-left">Am</td>
<td class="org-left">B&flat;</td>
<td class="org-left">C</td>
<td class="org-left">Dm</td>
</tr>


<tr>
<td class="org-left">C</td>
<td class="org-left">C</td>
<td class="org-left">Dm</td>
<td class="org-left">Em</td>
<td class="org-left">F</td>
<td class="org-left">G</td>
<td class="org-left">Am</td>
</tr>


<tr>
<td class="org-left">G</td>
<td class="org-left">G</td>
<td class="org-left">Am</td>
<td class="org-left">Bm</td>
<td class="org-left">C</td>
<td class="org-left">D</td>
<td class="org-left">Em</td>
</tr>


<tr>
<td class="org-left">D</td>
<td class="org-left">D</td>
<td class="org-left">Em</td>
<td class="org-left">F&sharp;m</td>
<td class="org-left">G</td>
<td class="org-left">A</td>
<td class="org-left">Bm</td>
</tr>


<tr>
<td class="org-left">A</td>
<td class="org-left">A</td>
<td class="org-left">Bm</td>
<td class="org-left">C&sharp;m</td>
<td class="org-left">D</td>
<td class="org-left">E</td>
<td class="org-left">F&sharp;m</td>
</tr>


<tr>
<td class="org-left">E</td>
<td class="org-left">E</td>
<td class="org-left">F&sharp;m</td>
<td class="org-left">G&sharp;m</td>
<td class="org-left">A</td>
<td class="org-left">B</td>
<td class="org-left">C&sharp;m</td>
</tr>


<tr>
<td class="org-left">B</td>
<td class="org-left">B</td>
<td class="org-left">C&sharp;m</td>
<td class="org-left">D&sharp;m</td>
<td class="org-left">E</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">G&sharp;m</td>
</tr>


<tr>
<td class="org-left">F&sharp;</td>
<td class="org-left">F&sharp;</td>
<td class="org-left">G&sharp;m</td>
<td class="org-left">A&sharp;m</td>
<td class="org-left">B</td>
<td class="org-left">C&sharp;</td>
<td class="org-left">D&sharp;m</td>
</tr>
</tbody>
</table>


# Pieces of music and songs


## Chord progressions


### TODO progression usage


### TODO commonly used progressions


## Chord Inversions


### TODO inversion usage


## Melodies


### TODO melodies


# Appendix


## Various scales


## TODO document various scales

-   Chromatic:
    If you play the 12 semitones, say by going up a guitar string, fret by fret, or by playing each 
    note (white and black) on a piano.

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">pattern</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
<td class="org-right">S</td>
</tr>


<tr>
<td class="org-left">semitones</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

-   Major:

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">pattern</td>
<td class="org-right">T</td>
<td class="org-right">T</td>
<td class="org-right">S</td>
<td class="org-right">T</td>
<td class="org-right">T</td>
<td class="org-right">T</td>
<td class="org-right">S</td>
</tr>


<tr>
<td class="org-left">semitones</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-left">Interval</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

-   Minor scale:

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">pattern</td>
<td class="org-right">T</td>
<td class="org-right">S</td>
<td class="org-left">T</td>
<td class="org-right">T</td>
<td class="org-right">S</td>
<td class="org-left">T</td>
<td class="org-left">T</td>
</tr>


<tr>
<td class="org-left">semitones</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-left">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-left">2</td>
<td class="org-left">2</td>
</tr>


<tr>
<td class="org-left">Interval</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-left">b3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-left">b6</td>
<td class="org-left">b7</td>
</tr>
</tbody>
</table>

-   Pentatonic scales:
    Some poeople provide a pattern for pentatonic scales but I prefer to think about them
    as selecting 5 notes (penta) from the Major or Minor scale.

&#x2013; from the Major scale include 1, 2, 3, 5, 6 or skip the 4th and 7th

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">semitones</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
</tr>


<tr>
<td class="org-left">Interval</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">7</td>
</tr>


<tr>
<td class="org-left">Include?</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">X</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">X</td>
</tr>
</tbody>
</table>

&#x2013; from the Minor scale include 1, b3, 4, 5, b7 or exclude the 2nd and flat 6th

<table border="0" cellspacing="0" cellpadding="6" rules="all" frame="none">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">semitones</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-left">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-left">2</td>
<td class="org-left">2</td>
</tr>


<tr>
<td class="org-left">Interval</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-left">b3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-left">b6</td>
<td class="org-left">b7</td>
</tr>


<tr>
<td class="org-left">Include?</td>
<td class="org-right">1</td>
<td class="org-right">X</td>
<td class="org-left">b3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-left">X</td>
<td class="org-left">b7</td>
</tr>
</tbody>
</table>


# Useful links

-   Piano Exercises: <https://pianoexercises.org> recommended to me was <https://pianoexercises.org/exercises/czerny/>
-   Various musical transcriptions: <https://imslp.org>
-   Chordmaps, music theory and chordmaps midi app: <https://www.mugglinworks.com/>
-   An instrument supplier who will ship to HK cheaper than buying locally <https://www.thomann.de>
-   <https://www.musictheory.net>
-   I think Andrew Huang's music theory in 1/2 hr is one of the 
    easiest run-through's of music theory <https://www.youtube.com/watch?v=rgaTLrZGlk0>
    Note, you should do the exercises and it's not half an hour, it's weeks of work if
    you take learning music theory seriously. Tip: Play it at 1.5x
-   Some really insightful analysis of chord progressions and melodic overlays from the 80's
    <https://www.youtube.com/watch?v=jav5xMqBWeY>
-   Piano scales and their fingerings: <https://www.pianoscales.org>

